короче; выведи числа до ста в ввиде 1 футболист
2 футболиста 3 фублолиста 4 футболиста 5 футболистов и тд




<?php
$a = 'а';
$b = 'ов';
$c = 'футболист';
for ($i = 1;$i<100;$i++){

    if($i != 11 and $i % 10 == 1){
        echo $i.' '.$c.'<br>';
    }
    elseif ($i % 10 == 2 and $i != 12){
        echo $i.' '.$c.$a.'<br>';
    }

    elseif ($i % 10 == 3 and $i != 13){
        echo $i.' '.$c.$a.'<br>';
    }

    elseif ($i % 10 == 4 and $i != 14){
        echo $i.' '.$c.$a.'<br>';
    }
    else {
        echo $i.' '.$c.$b.'<br>';
    }

}